Catalogs/НастройкиВыполненияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиВыполненияОбмена</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.НастройкиОбменаДанными</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыполнятьДействияПодПолнымиПравами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентныеЗадания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическиИзменятьИнтервалМеждуОбменами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаждыйЗапускПрограммы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаждоеЗавершениеРаботыСПрограммой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогПроверкиДоступности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьОбменПриПоявленииФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииНаВыгрузкуДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииНаЗагрузкуДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьОтправкиСообщенияОбОшибке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДляОтправкиСообщенийОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НастройкаОбмена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполняемоеДействие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействиеПриОбмене</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СообщенияНеЯвляющиесяОшибками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМСПриУстановке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьРеализацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСрокНахожденияНаСкладе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСМС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМСПоШаблону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВозвратТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВозвратДенег</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВСтатусе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьСхемуРезервирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРезервирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыРезервирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачуНаОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВнПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаВнПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачуСрокХранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСрокХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаГруппеПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьМаркетПлэйс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрыватьРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТелеграм</Name>
					<Comment>Уведомление уходит в тот же момент, когда создаётся задача просрочки статуса.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмЧат</Name>
					<Comment>chat_id получателя уведомления. Узнаётся один раз: получатель нажимает Start у бота, затем ТелеграмБот.ПоказатьНовыеЧаты().</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредыдущиеСтатусыУсловиеОтправкиСМС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛичныеКонтакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛичныеКонтакты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминатьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДоНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МодульРегламентныхЗаданий/Ext/Module.bsl
Процедура ВыполнитьОбменДаннымиДляНастройкиОбмена(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиОбменаДанными.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена)
		ИЛИ НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ПроцедурыОбменаДанными.ВыполнитьОбменДаннымиПоПроизвольнойНастройке(НастройкаОбмена, Ложь);
			
КонецПроцедуры

Процедура ВыполнитьОтложенныеДвиженияДляНастройкиОбмена(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиОбменаДанными.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена)
		ИЛИ НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;	
	
	ПроцедурыОбменаДанными.ВыполнитьОтложенныеДвиженияПоНастройкеОбмена(НастройкаОбмена);
			
КонецПроцедуры

Процедура ВыполнитьОбменДаннымиДляНастройкиАвтоматическогоОбменаДанными(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиВыполненияОбмена.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена)
		ИЛИ НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ПроцедурыОбменаДанными.ВыполнитьОбменПоНастройкеАвтоматическогоВыполненияОбменаДанными(НастройкаОбмена, Ложь);
	
КонецПроцедуры


// Процедура выполняет пересчет регистров накопления, для удаления нулевых записей
Процедура ПересчетИтоговРегистровНакопления() Экспорт

	НаДату = НачалоМесяца(ТекущаяДата())-1;	
	ПересчетРегистров(РегистрыНакопления, НаДату, Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
	ПересчетРегистров(РегистрыБухгалтерии, НаДату);	
	
КонецПроцедуры

Процедура ПересчетРегистров(МенеджерРегистров, НаДату, ОграничениеПоВидуРегистра = Неопределено)
	
	Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
		
		Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
			Продолжить;
		КонецЕсли;
		ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату)
	
	Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов()<НаДату Тогда
		МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
	Иначе
		МенеджерРегистра.ПересчитатьИтоги();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеИндексаПолнотекстовогоПоиска() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Если НЕ ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			Попытка	
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Информация, , ,
				"Начато регламентное индексирование порции");
				
				ПолнотекстовыйПоиск.ОбновитьИндекс(Ложь, Истина);
				
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Информация, , ,
				"Закончено регламентное  индексирование порции");
			Исключение
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Ошибка, , ,
				"Во время регламентного обновления индекса произошла неизвестная ошибка: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
Конецпроцедуры

Процедура ОбновитьСтатусыЗаказов() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Собран=Справочники.СтатусыЗаказов.НайтиПоНаименованию("Собран");
	ЦБНеПолучена=Справочники.СтатусыЗаказов.НайтиПоНаименованию("ЦБ не получена");
	НаВозврате=Справочники.СтатусыЗаказов.НайтиПоНаименованию("На возврате");
	Отказ=Справочники.СтатусыЗаказов.НайтиПоНаименованию("Отказ");
	Неудачные=Справочники.СтатусыЗаказов.НайтиПоНаименованию("Не удачные");
	Завершенные=Справочники.СтатусыЗаказов.НайтиПоНаименованию("Завершенные");
			
	
	СписСтатусовЗак = Новый СписокЗначений;
	СписСтатусовЗак.Добавить(ЦБНеПолучена);
	СписСтатусовЗак.Добавить(Завершенные);
	СписСтатусовЗак.Добавить(НаВозврате);
	//СписСтатусовЗак.Добавить(Собран);
	
	СписСтатусовОтпр = Новый СписокЗначений;
	//СписСтатусовОтпр.Добавить("Відправлення отримано");
	СписСтатусовОтпр.Добавить("Номер не знайдено");
	//СписСтатусовОтпр.Добавить("Змінено адресу");        
	//СписСтатусовОтпр.Добавить("Відмова від отримання");
	//СписСтатусовОтпр.Добавить("Видалено");
	//СписСтатусовОтпр.Добавить("Відправлення отримано. Грошовий переказ видано одержувачу.");
	//СписСтатусовОтпр.Добавить("");

	
	СписСтатусовОбратнойОтпр = СписСтатусовОтпр;
	
 
	//
	//
	// самостійно створив
	//
	//
	//
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказПокупателя.Ссылка КАК Ссылка,
		               |	ЗаказПокупателя.ТелефонКонтрагента КАК ТелефонКонтрагента,
		               |	ЗаказПокупателя.НомерТТН КАК НомерТТН,
		               |	ЗаказПокупателя.СтатусОтправки КАК СтатусОтправки,
		               |	ЗаказПокупателя.СпособОтправки КАК СпособОтправки,
		               |	ЗаказПокупателя.СкладНовойПочтыЗначение КАК СкладНовойПочтыЗначение,
		               |	ЗаказПокупателя.ГородНовойПочтыЗначение КАК ГородНовойПочтыЗначение,
		               |	ЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки,
		               |	ЗаказПокупателя.Дата КАК Дата,
		               |	ЗаказПокупателя.Контрагент КАК Контрагент,
		               |	ЗаказПокупателя.ДатаДоставки КАК ДатаДоставки,
		               |	ЗаказПокупателя.НеУчитыватьВОтчете КАК НеУчитыватьВОтчете,
		               |	ЗаказПокупателя.ТехнологияДоставки КАК ТехнологияДоставки,
		               |	ЗаказПокупателя.НомерТТНОбратнойДоставки КАК НомерТТНОбратнойДоставки,
		               |	ЗаказПокупателя.СтатусОбратнойДоставки КАК СтатусОбратнойДоставки,
		               |	ЗаказПокупателя.СуммаНоваяПочта КАК СуммаНоваяПочта,
		               |	ЗаказПокупателя.СтатусЗаказа КАК СтатусЗаказа,
		               |	ЗаказПокупателя.Номер КАК Номер,
		               |	ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента КАК АдресЭлектроннойПочтыКонтрагента
		               |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		               |ГДЕ
		               |	ЗаказПокупателя.СпособОтправки = &СпособОтправки
		               |	И (НЕ ЗаказПокупателя.СтатусОтправки В (&СтатусОтправки)
		               |			ИЛИ НЕ ЗаказПокупателя.СтатусОбратнойДоставки В (&СтатусОбратнойОтправки))
		               |	И НЕ ЗаказПокупателя.ПометкаУдаления
		               |	И ЗаказПокупателя.СтатусЗаказа В(&СтатусЗаказа)
		               |	И ЗаказПокупателя.Дата >= &Дата
		               |	И НЕ ЗаказПокупателя.НомерТТН = &НомерТТН";
		
		Запрос.УстановитьПараметр("СпособОтправки",Справочники.СпособыОтправки.НоваяПочта);
		Запрос.УстановитьПараметр("СтатусОтправки",СписСтатусовОтпр);
		Запрос.УстановитьПараметр("СтатусОбратнойОтправки",СписСтатусовОбратнойОтпр);
		
		Запрос.УстановитьПараметр("СтатусЗаказа",СписСтатусовЗак);
		Запрос.УстановитьПараметр("Дата",ДобавитьМесяц(ТекущаяДата(),-2));
		Запрос.УстановитьПараметр("НомерТТН","");
		
		Рез = Запрос.Выполнить().Выгрузить();
		Рез.Сортировать("Номер");
		
		Перевозчик = Справочники.Перевозчики.НайтиПоНаименованию("Новая почта");
		НастройкиОбмена = ОбменДаннымиСИСПеревозчиковСервер.ПолучитьНастройкиОбменаДанными(Перевозчик);
		КлючАПИ = Неопределено;
		Если НастройкиОбмена.Свойство("КлючAPI", КлючАПИ) Тогда

			Для Каждого ТекСтрока из Рез Цикл
				
				Объект = ТекСтрока.Ссылка;
				ТекОбъект = ТекСтрока.Ссылка.ПолучитьОбъект();
							
				ТекОбъект.ЗакрытиеЗаказа();
				
				Если НЕ ЗначениеЗаполнено(ТекСтрока.НомерТТН) Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрЧислоВхождений(ТекСтрока.СтатусОтправки,"Відправлення отримано") И Не Объект.СтатусЗаказа = ЦБНеПолучена Тогда
					 Продолжить;
				КонецЕсли; 

				
				ТЗ = Новый ТаблицаЗначений;
				ТЗ.Колонки.Добавить("НомерДок");
				ТЗ.Колонки.Добавить("Телефон");
				НС = ТЗ.Добавить();
				НС.НомерДок = ТекСтрока.НомерТТН; 
				НС.Телефон = "380982487868";
				
				Ответ = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.СтатусНакладнойНов(КлючАПИ,ТЗ);
				
				Если Ответ.Количество()>0 Тогда
					СтруктураОтвета = Ответ[0];
				Иначе
					Продолжить;
				КонецЕсли;
				
				СтатусОтправки = СтруктураОтвета.СтатусДокумента;
				СтатусОтправкиПоОснТТН = СтруктураОтвета.СтатусДокумента;
				ДатаДоставки = СтруктураОтвета.ДатаДоставки;
				ПричинаОтказа = СтруктураОтвета.ПричинаОтказа;
				ТТНОбратнойДоставки = СтруктураОтвета.ТТНОбратнойДоставки;
			    ЕстьТТНОбратнойДоставки = (ТТНОбратнойДоставки <> "");
				
				ЕстьПереадресация = СтруктураОтвета.ЕстьПереадресация;
				ПередатьНаСайт = Ложь;
				
				//Если Объект.СтатусЗаказа = Завершенные И
				//	(Не ЗначениеЗаполнено(Объект.СтатусОбратнойДоставки) Или Не ЗначениеЗаполнено(Объект.СтатусОтправки) ИЛИ
				//		  НЕ ЗначениеЗаполнено(Объект.НомерТТН))
				//	Тогда
				//	Продолжить;
				
				Если СтрНайти( СтатусОтправки,ТекОбъект.СтатусОтправки) = 0 Тогда
					ПередатьНаСайт = Истина;
					Сообщить(ТекОбъект.Номер + " выгружаем");
				Иначе
					Сообщить(ТекОбъект.Номер + " такой же статус не выгружаем");
				КонецЕсли;
								
				СтарыйСтатусОбратнойДоставки = Объект.СтатусОбратнойДоставки;
								
				СтарыйСтатусОтправки =  Объект.СтатусОтправки;
				
				ТекОбъект.СтатусОтправки = СтатусОтправки;
				
				Если ЕстьТТНОбратнойДоставки и Не ТекСтрока.СтатусЗаказа=ЦБНеПолучена Тогда
					
					ТЗ[0].НомерДок = ТТНОбратнойДоставки; 
					
					Ответ = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.СтатусНакладнойНов(КлючАПИ,ТЗ);
					Если Ответ.Количество()>0 Тогда
						СтруктураОтвета = Ответ[0];
					Иначе
						Продолжить;
					КонецЕсли;
					СтатусОтправки = СтруктураОтвета.СтатусДокумента; 			
					ДатаДоставки = СтруктураОтвета.ДатаДоставки;
					ПричинаОтказа = СтруктураОтвета.ПричинаОтказа;
					
					ТекОбъект.НомерТТНОбратнойДоставки = ТТНОбратнойДоставки;	
					ТекОбъект.СтатусОбратнойДоставки = СтатусОтправки;	
				
					Если  СтрНайти( СтатусОтправки,СтарыйСтатусОбратнойДоставки) = 0 Тогда 
						ПередатьНаСайт = Истина;
					КонецЕсли;


				Иначе 
						
					ТекОбъект.НомерТТНОбратнойДоставки = "";
					ТекОбъект.СтатусОбратнойДоставки = "";
				КонецЕсли;
				
				СрокХранения = Документы.ЗаказПокупателя.СрокХранения(ДатаДоставки);
				
			
				
				//Оповещение возврат 
				Если Объект.СтатусЗаказа=НаВозврате Тогда
					Если Объект.СрокХранения = СрокХранения Или
						 СтатусОтправки = ?(ЕстьТТНОбратнойДоставки,СтарыйСтатусОбратнойДоставки,СтарыйСтатусОтправки)
						 Тогда
						 
							 Если СтрЧислоВхождений(СтатусОтправки,"Прибув") Тогда
							     СоздатьЗадачу("Получить Возврат","Получить Возврат по адресу " + СтруктураОтвета.АдресДоставки + " " + ТТНОбратнойДоставки,Объект);
							 ИначеЕсли СтрЧислоВхождений(СтатусОтправки,"отримано") Тогда
								 СоздатьЗадачу("Возврат Получен","Возврат Получен нужно изменить статус заказа",Объект);
							 КонецЕсли;
						       
					КонецЕсли;
				КонецЕсли;
								
				Если ТекСтрока.СтатусОтправки="Видалено" Тогда
					
					 ИдентификаторСобытия = "Видалено";
					 Наименование = ИдентификаторСобытия; 
					 СоздатьЗадачу(ИдентификаторСобытия,Наименование,Объект);
				КонецЕсли;
				
				СамостійноСтворив="Відправник самостійно створив цю накладну, але ще не надав до відправки"; 
				
				Если НачалоДня(ТекСтрока.ДатаОтгрузки) <> НачалоДня(ТекущаяДата()) И
					 ТекСтрока.СтатусОтправки=СамостійноСтворив И (
					 ТекСтрока.СтатусЗаказа=ЦБНеПолучена Или
					 ТекСтрока.СтатусЗаказа=Завершенные)
					Тогда
					
					 ИдентификаторСобытия = "самостійно створив";	 
					 СоздатьЗадачу(ИдентификаторСобытия,СамостійноСтворив,Объект);
				КонецЕсли;
				
				Если ТекСтрока.СтатусЗаказа=ЦБНеПолучена Тогда
					
					Если ТекСтрока.СтатусОтправки="Змінено адресу" Тогда
						ИдентификаторСобытия = "Змінено адресу";		 
						СоздатьЗадачу(ИдентификаторСобытия,"Змінено адресу",Объект);
					КонецЕсли;
					 
					Если ТекСтрока ="Відправлення отримано" Тогда
					 
						ИдентификаторСобытия = "ОшибкаНаложкиСтатусПоТТН!!!"; 
						Наименование = "Ошибка Наложки Статус По ТТН";
					 
					 	СоздатьЗадачу(ИдентификаторСобытия,Наименование,Объект,Ложь);
					КонецЕсли;
					
				КонецЕсли;

				//отправим оповещение об отказе
				Если СтрЧислоВхождений(ВРег(СтатусОтправкиПоОснТТН),"ВІДМОВА") И
					 ТекСтрока.СтатусЗаказа<>НаВозврате 
					Тогда
					
					 //Тел = ОбщегоНазначения.ТелефонКонтрагента(ТекСтрока.Контрагент);
					 //Тел = ОбщегоНазначения.ПоправитьТелефон(Тел);
					 //ТекстСМС = Константы.ШаблонСМСОтказа.Получить().Текст;
					 //ОбщийМодульПодписокНаСобытия.ОтправкаСМСУведомленияОтдельно(ТекСтрока.Ссылка,ТекстСМС,Тел);
					 
					 ТекОбъект.ПричинаОтказа = ПричинаОтказа;	
					 ТекОбъект.СтатусЗаказа = НаВозврате;
					 ПередатьНаСайт = Истина;
				КонецЕсли;
				
				//меняем кассу при получении денег получателем
				Если Константы.ПерещатьВЗавершенные.Получить() И
					 СтрЧислоВхождений(СтатусОтправки,"Відправлення отримано. Протягом доби відправник отримає SMS-повідомлення")>0 И
					 ТекСтрока.СтатусЗаказа=ЦБНеПолучена 
					 Тогда
					 
					НайденПКО = ОбщийМодульПодписокНаСобытия.НайтиПКО(ТекСтрока.Ссылка);
						
					Если ЗначениеЗаполнено(НайденПКО) Тогда
						ПКО = НайденПКО.ПолучитьОбъект();
		                ПКО.Касса = Справочники.Кассы.НайтиПоКоду("000000020");
						ПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							
						Попытка
							ПКО.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							ПКО.Записать(РежимЗаписиДокумента.Запись);
						КонецПопытки;
					КонецЕсли; 		
				КонецЕсли;

				// получили наложку
				Если Константы.ПерещатьВЗавершенные.Получить() И
					 ТекСтрока.СтатусЗаказа=ЦБНеПолучена И 
					 ТекОбъект.ТипОбратнойДоставки = Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000009") //09

					Тогда
					Если СтрЧислоВхождений(СтатусОтправки,"Грошовий переказ видано одержувачу")>0 Тогда
						 ТекОбъект.СтатусЗаказа = Завершенные;
					 	 ПередатьНаСайт = Истина;
					ИначеЕсли СтатусОтправки = "Відправлення отримано" Тогда
					      СоздатьЗадачу(ИдентификаторСобытия,"Нет наложки по факту!!!",Объект, Ложь);
					КонецЕсли;			 	
				КонецЕсли;	
		
				ТекОбъект.СрокХранения = СрокХранения;
				ТекОбъект.ДатаДоставки = ДатаДоставки;

				Попытка
					ТекОбъект.Записать();		
				Исключение
				КонецПопытки;
			
				Если ПередатьНаСайт Тогда
					ПередатьЗаказНаСайт(ТекСтрока.Ссылка);
					//ТекСтрока.Ссылка.ПолучитьОбъект().ОбработкаПроведенияМ(Ложь,РежимЗаписиДокумента.Проведение,Ложь);  //.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
  
   	ЗаказыДнейХранения();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаказыДнейХранения() Экспорт
	
	//ДатаПроверки = Константы.ДнейХраненияПроверено.Получить();
	//
	//Если  ДатаПроверки = НачалоДня(ТекущаяДата()) Тогда // сегодня уже проверяли
	//	Возврат;
	//КонецЕсли;
	//
	//Константы.ДнейХраненияПроверено.Установить(ТекущаяДата());
	
	
	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Ссылка КАК Ссылка,
	               |	ЗаказПокупателя.СрокХранения КАК СрокХранения,
	               |	ЗаказПокупателя.ДатаДоставки КАК ДатаДоставки
				   |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	НЕ ЗаказПокупателя.ПометкаУдаления
	               |	И ЗаказПокупателя.Дата МЕЖДУ &НачДата И &КонДата
	               |	И (ЗаказПокупателя.СтатусОтправки ПОДОБНО &СтатусОтправки
	               |			ИЛИ ЗаказПокупателя.СтатусОбратнойДоставки ПОДОБНО &СтатусОбратнойДоставки)";
	
	
	Запрос.УстановитьПараметр("НачДата",ДобавитьМесяц(ТекущаяДата(),-3));
	Запрос.УстановитьПараметр("КонДата",ТекущаяДата());
	Запрос.УстановитьПараметр("СтатусОтправки","%Прибув у відділення%");
	Запрос.УстановитьПараметр("СтатусОбратнойДоставки","%Прибув у відділення%");
	
	Рез = Запрос.Выполнить().Выгрузить();
		
	Для Каждого Зак Из Рез Цикл
		Если Не ЗначениеЗаполнено(Зак.Ссылка.СтатусЗаказа) ИЛИ 
			 НЕ ЗначениеЗаполнено(Зак.Ссылка.СтатусЗаказа.ПользовательСрокХранения) ИЛИ 
			 Зак.СрокХранения = 0 ИЛИ
			 Зак.СрокХранения < Зак.Ссылка.СтатусЗаказа.СрокХранения
			Тогда
			Продолжить; 
		КонецЕсли;
		
		//оповещаем один раз
		Описание = "Заказ хранится на отделении "+СокрЛП(Зак.СрокХранения)+" дня" + " с " + Зак.ДатаДоставки;
		
		УжеОповещенСтатус = Документы.ЗаказПокупателя.ДнейВХраненияОповещен(Зак.Ссылка,Описание);	
		Если УжеОповещенСтатус Тогда Продолжить; КонецЕсли;
		
		СуществующаяЗадача = БИАС.ПолучитьЗадачуКонтрагентаПоИдентификатору(Зак.Ссылка.Контрагент, "СрокХранения_" + Зак.Ссылка.Номер, Справочники.Пользователи.НайтиПоКоду("000000023"));
		
		Если СуществующаяЗадача <> Неопределено Тогда 
			Задача = СуществующаяЗадача.Ссылка.ПолучитьОбъект();
			Задача.Выполнена = Истина;
			Попытка
				Задача.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		
		// Диагностика: флаг СтатусыЗаказов.ФормироватьЗадачуСрокХранения нигде не читается,
		// задача создаётся по заполненности ПользовательСрокХранения (условие выше).
		// Логику НЕ меняем: фиксируем, для каких статусов задача реально создаётся при
		// снятой галке. Если событие не появится — флаг можно включать в условие безопасно.
		Если НЕ Зак.Ссылка.СтатусЗаказа.ФормироватьЗадачуСрокХранения Тогда
			ОбщийМодульПодписокНаСобытия.ЛогСтатуса(Зак.Ссылка, "ЗадачаСрокХранения_ФлагСнят",
				"задача создаётся, хотя ФормироватьЗадачуСрокХранения = Ложь");
		КонецЕсли;
		
		Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
		
		Задача.Наименование   = "Количество дней хранения " + СокрЛП(Зак.СрокХранения);
		Задача.Исполнитель    = Зак.Ссылка.СтатусЗаказа.ПользовательСрокХранения;
		Задача.Дата           = ТекущаяДата();
		Задача.Объект         = Зак.Ссылка;
		Задача.Оповещение     = Истина;
		Задача.ИдентификаторСобытия = "СрокХранения_" + Зак.Ссылка.Номер;
		Задача.СрокОповещения = Задача.Дата +       5 * 60;
		Задача.СрокИсполнения = Задача.Дата + 24 * 60 * 60;
		Задача.Описание       = Описание;
		
		Попытка
			Задача.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;		
	КонецЦикла;
		
КонецПроцедуры


Процедура ПередатьЗаказНаСайт(ЗаказПокупателя) Экспорт
	
	Если Не Константы.ВыгружатьДокументыНаСайтПриПроведении.Получить() Тогда
		Возврат;
	КонецЕсли;
		
	// Заказ ставится в очередь выгрузки на сайт: сама передача выполняется после
	// фиксации записи документа (регламентное задание ВыгрузкаЗаказовНаСайт или
	// фоновое задание, запущенное из ЗаказПокупателя.ПриЗаписи).
	//
	// Раньше здесь собиралась плоская структура реквизитов заказа и передавалась
	// в БИАС.ПередатьЗаказНаСайт, которая ждёт ссылку на документ: выгрузка молча
	// падала на первой же строке, и статус на сайт не уходил вообще.
	БИАС.ЗарегистрироватьЗаказКВыгрузкеНаСайт(ЗаказПокупателя);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Сделка = &Заказ
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И НЕ РеализацияТоваровУслуг.Ссылка В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ЗаказПокупателя.ОсновнойЗаказ
		|				ИЗ
		|					Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|				ГДЕ
		|					ЗаказПокупателя.ОсновнойЗаказ.Сделка = &Заказ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказПокупателя.ОсновнойЗаказ
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Заказ
		|	И НЕ ЗаказПокупателя.ОсновнойЗаказ.ПометкаУдаления
		|	И ЗаказПокупателя.ОсновнойЗаказ ССЫЛКА Документ.РеализацияТоваровУслуг";
	
	
	Запрос.УстановитьПараметр("Заказ", ЗаказПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Биас.ПередатьНакладнуюНаСайтВФоне(Выборка.Реализация);
	КонецЦикла;
	
КонецПроцедуры

Функция ПросроченоДней(ДатаДоставки)
	КолДней = (НачалоДня(ТекущаяДата())-НачалоДня(ДатаДоставки))/86400;
	Если КолДней<0 Тогда
		Возврат  0;
	КонецЕсли;
	Выходн = 0;
	Для Сч = 1 По КолДней Цикл
		Если ДеньНедели(НачалоДня(ДатаДоставки)+Сч*86400) = 7 Тогда
			Выходн = Выходн+1;
		КонецЕсли;
	КонецЦикла;
	Возврат КолДней-Выходн;
КонецФункции


Процедура СлияниеИндексаПолнотекстовогоПоиска() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Попытка	
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Начато регламентное слияние индексов");
				
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
				
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Закончено регламентное слияние индексов");
		Исключение
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Во время регламентного слияния индекса произошла неизвестная ошибка: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
Конецпроцедуры

// Функция выделяет необходимые части из строки запуска
//
Функция ВыделитьПодстрокуСтрокиЗапуска(СтрокаЗапуска, КлючПодстроки)

	НомерПервогоСимвола = Найти(ВРег(СтрокаЗапуска), ВРег(КлючПодстроки)) + СтрДлина(КлючПодстроки);
	Для Счетчик = НомерПервогоСимвола По СтрДлина(СтрокаЗапуска) Цикл
		Если Сред(СтрокаЗапуска, Счетчик, 1) = ";" Тогда
			НомерПоследнегоСимвола = Счетчик - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Получаем искомую подстроку
	ИскомаяПодстрока = Сред(СтрокаЗапуска, НомерПервогоСимвола, (НомерПоследнегоСимвола - НомерПервогоСимвола + 1));
	Если Сред(ИскомаяПодстрока, 1, 1) = """" Тогда
		// Если подстрока в кавычках, то выделяем их
		ИскомаяПодстрока = Сред(ИскомаяПодстрока, 2, (СтрДлина(ИскомаяПодстрока) - 2));
	КонецЕсли;
	
	Возврат ИскомаяПодстрока;

КонецФункции // ВыделитьПодстроку()

// Процедура производит действия, приводящие к регламетному обновлению ИБ,
// но только для серверного варианта
Процедура ОбновлениеКонфигурации() Экспорт

	СтруктураОбновленияИБ = Константы.НастройкаОбновленияКонфигурации.Получить().Получить();
	Если ТипЗнч(СтруктураОбновленияИБ) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		ФайлОбновления = Константы.ФайлКонфигурацииДляОбновления.Получить().Получить();
		Если ТипЗнч(ФайлОбновления) = Тип("ДвоичныеДанные") Тогда
			ПутьКФайлу = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".cf";
			ФайлОбновления.Записать(ПутьКФайлу);
			СтруктураОбновленияИБ.Вставить("ФайлОбновленияКонфигурации", ПутьКФайлу);
			СтруктураОбновленияИБ.Вставить("ОписаниеФайлаОбновленияКонфигурации", Константы.ОписаниеФайлаКонфигурацииДляОбновления.Получить());
		Иначе
			СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Если СтрЧислоВхождений(ВРег(СтрокаСоединения), "FILE=") Тогда
		Возврат;
	КонецЕсли;
	
	СтрДлина = СтрДлина(СтрокаСоединения);
	
	// Ищем имя сервера
	СтрокаСервера = ВыделитьПодстрокуСтрокиЗапуска(СтрокаСоединения, "Srvr=");
	// Если в имени сервера присутствует имя порта, то выделяем его
	РазделительПорта = Найти(СтрокаСервера, ":");
	Если РазделительПорта > 0 Тогда
		ИмяСервера = Сред(СтрокаСервера, 1, (РазделительПорта - 1));
		НомерПортаКластера = Сред(СтрокаСервера, (РазделительПорта + 1));
	Иначе
		ИмяСервера = СтрокаСервера;
		ком = Новый COMОбъект(УправлениеСоединениямиИБ.ИмяCOMСоединителя());
		НомерПортаКластера = ком.RMngrPortDefault;
	КонецЕсли; 
	
	// Ищем имя ИБ
	ИмяИБ = ВыделитьПодстрокуСтрокиЗапуска(СтрокаСоединения, "Ref=");
	
	ТекстСообщенияБлокировки = СтруктураОбновленияИБ.СообщениеОБлокировкеИБ;
	ПараметрБлокировки = СтруктураОбновленияИБ.ПараметрБлокировкиИБ;
	ИмяАдминистратораКластера = СтруктураОбновленияИБ.ИмяАдминистратораКластера;
	ПарольАдминистратораКластера = СтруктураОбновленияИБ.ПарольАдминистратораКластера;
	ИмяАдминистратораИБ = СтруктураОбновленияИБ.ИмяАдминистратораИБ;
	ИсполняемыйФайлКлиентаНаСервере = СтруктураОбновленияИБ.ИсполняемыйФайлКлиентаНаСервере;
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяАдминистратораИБ);
	НовыйПароль = Лев(Строка(Новый УникальныйИдентификатор), 20);
	Пользователь.Пароль = НовыйПароль;
	Пользователь.Записать();
	ПарольАдминистратораИБ = НовыйПароль;
	
	ПутьКФайлуЖурнала = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".txt";
	
	ШаблонТекста = ПолучитьОбщийМакет("МакетФайлаОбновленияКонфигурации");
	
	КонечныйТекст = ШаблонТекста.ПолучитьОбласть("ОбластьДоОбновленияКонфигурации");
	КонечныйТекст.УдалитьСтроку(1);
	КонечныйТекст.УдалитьСтроку(КонечныйТекст.КоличествоСтрок());
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьЗагрузкиИзмененнойКонфигурации");
		ПромТекст.УдалитьСтроку(1);
		ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
		КонечныйТекст.УстановитьТекст(КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст());
	КонецЕсли;
	Если СтруктураОбновленияИБ.ОбновлятьКонфигурациюИБ Тогда
		ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьОбновленияКонфигурацииБД");
		ПромТекст.УдалитьСтроку(1);
		ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
		КонечныйТекст.УстановитьТекст(КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст());
	КонецЕсли;
	ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьПослеОбновленияКонфигурации");
	ПромТекст.УдалитьСтроку(1);
	ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
	КонечныйТекст = КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст();
	
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ServerName]", """" + ИмяСервера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[KlasterPortNumber]", СтрЗаменить(Строка(НомерПортаКластера), Символы.НПП, ""));
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBaseName]", """" + ИмяИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[LockMessageText]", """" + ТекстСообщенияБлокировки + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[LockPermissionCode]", """" + ПараметрБлокировки + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ClasterAdminName]", """" + ИмяАдминистратораКластера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ClasterAdminPass]", """" + ПарольАдминистратораКластера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBasesAdminName]", """" + ИмяАдминистратораИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBasesAdminPass]", """" + ПарольАдминистратораИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[NewPass]", """" + Лев(Строка(Новый УникальныйИдентификатор), 20) + """");
	
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[TimeBeginLock]", "CDate(""" + Формат((ТекущаяДата() + 60*5), "ДФ=""дд/ММ/гггг ЧЧ:мм:сс""") + """)");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[TimeEndLock]", "CDate(""" + Формат((ТекущаяДата() + 60*5 + 60*60*2), "ДФ=""дд/ММ/гггг ЧЧ:мм:сс""") + """)");
	
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Cfg]", """" + СтруктураОбновленияИБ.ФайлОбновленияКонфигурации + """");
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ОписаниеФайлаОбновленияКонфигурации]", """" + СтруктураОбновленияИБ.ОписаниеФайлаОбновленияКонфигурации + """");
	Иначе
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Cfg]", """" + "" + """");
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ОписаниеФайлаОбновленияКонфигурации]", """" + "" + """");
	КонецЕсли; 
	Если ТипЗнч(ИсполняемыйФайлКлиентаНаСервере) = Тип("Строка") И НЕ ПустаяСтрока(ИсполняемыйФайлКлиентаНаСервере) Тогда
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[v8exe]", """" + ИсполняемыйФайлКлиентаНаСервере + """");
	Иначе
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[v8exe]", """" + КаталогПрограммы() + "1cv8.exe" + """");
	КонецЕсли; 
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Out]", """" + ПутьКФайлуЖурнала + """");

	ИмяВременногоФайла = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".vbs";
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[FilePath]", """" + ИмяВременногоФайла + """");
	
	Скрипт = Новый ТекстовыйДокумент;
	Скрипт.Вывод = ИспользованиеВывода.Разрешить;
	Скрипт.УстановитьТекст(КонечныйТекст);
	Скрипт.Записать(ИмяВременногоФайла, КодировкаТекста.Системная);
	
	Ком = Новый COMObject("wScript.Shell");
	Ком.Run("""" + ИмяВременногоФайла + """");
	
КонецПроцедуры

// Процедура формирует задачи о необходимости поздравить с днем рождения
//
Процедура СоздатьЗадачиПоздравленияСДнемРождения() Экспорт
	
	УсловиеЗадачи = УправлениеКонтактами.ПолучитьСтрокуУсловияДР();
	
	Запрос = Новый Запрос;

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контакты.КонтактноеЛицо                             КАК КонтактноеЛицо,
	|	Контакты.Владелец.ОсновнойМенеджерПокупателя        КАК Исполнитель,
	|	Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания КАК ИнтервалДней,
	|	Контакты.КонтактноеЛицо.ДатаРождения                КАК ДатаРождения,
	|	Задачи.СрокИсполнения                               КАК Срок
	|ИЗ
	|	Справочник.КонтактныеЛицаКонтрагентов КАК Контакты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ПО
	|	Задачи.Объект = Контакты.КонтактноеЛицо
	|	И Задачи.Оповещение = ИСТИНА
	|	И Задачи.СрокИсполнения > ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, РАЗНОСТЬДАТ(Контакты.КонтактноеЛицо.ДатаРождения, ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания), МЕСЯЦ)/12 - 1)
	|	И Задачи.ПамятнаяДата = ИСТИНА
	|ГДЕ
	|	Контакты.КонтактноеЛицо.НапоминатьОДнеРождения = ИСТИНА
	|	И Контакты.Владелец ССЫЛКА Справочник.Контрагенты
	|	И Контакты.Владелец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контакты.Владелец.ОсновнойМенеджерПокупателя <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ((ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) >= &ТекДата
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ДЕНЬ, -(Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) <= &ТекДата)
	|	ИЛИ (ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) >= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ДЕНЬ, -(Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) <= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)))
	|	И Задачи.СрокИсполнения ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЛичныеКонтакты.Ссылка,
	|	ЛичныеКонтакты.ПользовательДляОграниченияПравДоступа,
	|	ЛичныеКонтакты.КоличествоДнейДоНапоминания,
	|	ЛичныеКонтакты.ДатаРождения,
	|	Задачи.СрокИсполнения
	|ИЗ
	|	Справочник.ЛичныеКонтакты КАК ЛичныеКонтакты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ПО
	|	Задачи.Объект = ЛичныеКонтакты.Ссылка
	|	И Задачи.Оповещение = ИСТИНА
	|	И Задачи.СрокИсполнения > ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, РАЗНОСТЬДАТ(ЛичныеКонтакты.ДатаРождения, ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, ЛичныеКонтакты.КоличествоДнейДоНапоминания), МЕСЯЦ)/12 - 1)
	|	И Задачи.ПамятнаяДата = ИСТИНА
	|ГДЕ
	|	ЛичныеКонтакты.НапоминатьОДнеРождения = ИСТИНА
	|	И ЛичныеКонтакты.ПользовательДляОграниченияПравДоступа <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ((ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) >= &ТекДата
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ДЕНЬ, -(ЛичныеКонтакты.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) <= &ТекДата)
	|	ИЛИ (ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) >= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ДЕНЬ, -(ЛичныеКонтакты.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) <= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)))
	|	И Задачи.СрокИсполнения ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ТекДата"      , ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий()Цикл
		
		НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
		НоваяЗадача.Дата           =ТекущаяДата();
		НоваяЗадача.Наименование   = Строка(РезультатЗапроса.КонтактноеЛицо) + ". " + УсловиеЗадачи;
		НоваяЗадача.ПамятнаяДата   = Истина;
		НоваяЗадача.Исполнитель    = РезультатЗапроса.Исполнитель;
		НоваяЗадача.Инициатор      = РезультатЗапроса.Исполнитель;
		НоваяЗадача.СрокИсполнения = Дата(Год(ТекущаяДата() + (РезультатЗапроса.ИнтервалДней * 24 * 60 * 60)), Месяц(РезультатЗапроса.ДатаРождения), День(РезультатЗапроса.ДатаРождения), 00, 00, 00);
		НоваяЗадача.Оповещение     = Истина;
		НоваяЗадача.СрокОповещения = НоваяЗадача.СрокИсполнения - (РезультатЗапроса.ИнтервалДней * 24 * 60 * 60);
		НоваяЗадача.Объект         = РезультатЗапроса.КонтактноеЛицо;
		
		Попытка
			НоваяЗадача.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры // СоздатьЗадачиПоздравленияСДнемРождения()

///////////////////////////////////////////
// Процедуры получения электронных сообщений
//

функция СоздатьЗадачу(ИдентификаторСобытия,Наименование,Объект,ЗадачаВыполнена = Истина)
	 ИсполнительГуппа = Справочники.Пользователи.НайтиПоНаименованию("Малюта Виталик").Родитель;
	
	 Запрос = Новый Запрос;
	 
	 Если ЗадачаВыполнена Тогда 
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	ЗадачиПользователя.Ссылка КАК Ссылка
		                |ИЗ
		                |	Задача.ЗадачиПользователя КАК ЗадачиПользователя
		                |ГДЕ
		                |	ЗадачиПользователя.ИдентификаторСобытия = &ИдентификаторСобытия
		                |	И ЗадачиПользователя.Объект = &Объект";
		
 	Иначе 
	  Запрос.Текст = "ВЫБРАТЬ
	                |	ЗадачиПользователя.Ссылка КАК Ссылка
	                |ИЗ
	                |	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	                |ГДЕ
	                |	ЗадачиПользователя.ИдентификаторСобытия = &ИдентификаторСобытия
	                |	И ЗадачиПользователя.Объект = &Объект
	                |	И ЗадачиПользователя.Выполнена = &Выполнена";

		Запрос.УстановитьПараметр("Выполнена",ЗадачаВыполнена);	 
	КонецЕсли;
	Запрос.УстановитьПараметр("ИдентификаторСобытия",ИдентификаторСобытия);
	Запрос.УстановитьПараметр("Объект",Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
	 	 Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
		 Задача.ИдентификаторСобытия = ИдентификаторСобытия;
		 Задача.Наименование         = Наименование;
		 Задача.Исполнитель          = ИсполнительГуппа;
		 Задача.Дата                 = НачалоДня(ТекущаяДата()) + 32400;
		 Задача.Объект               = Объект;
		 Задача.Оповещение           = Истина;
		 Задача.СрокОповещения       = Задача.Дата;
		 Задача.СрокИсполнения       = НачалоДня(ТекущаяДата()) + 32400;

		Попытка
		Задача.Записать();
		Исключение
		КонецПопытки;

	КонецЕсли;
КонецФункции


Процедура ПолучениеЭлектронныхСообщений() Экспорт
	
	Если НЕ Константы.ИспользованиеВстроенногоПочтовогоКлиента.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибок = "";
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(Неопределено, Справочники.Пользователи.ПустаяСсылка(),,,, Истина, Ложь, ТекстОшибок);
	
	Если ПустаяСтрока(ТекстОшибок) Тогда
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
			УровеньЖурналаРегистрации.Информация, Метаданные.Документы.ЭлектронноеПисьмо, ,
			"Получение электронных сообщений выполнено успешно");
	Иначе
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЭлектронноеПисьмо, ,
			"Получение электронных сообщений выполнено с ошибками:" + Символы.ПС + ТекстОшибок);
	КонецЕсли; 
	
КонецПроцедуры
